# Analisys of VK dataframes

In [212]:
import json
import pandas as pd
import matplotlib
import numpy as np
from dateutil.parser import parse

Values in csv file are stored in json format. That is done to simplify decoding objects (i.e. dates, some infos in attach column).

In [213]:
df = pd.read_csv("dataframe.csv")
df["date"] = df["date"].apply(lambda x: parse(json.loads(x)))

In [214]:
df.head()

,date,id,likes,req_count,attach_count,com_count,attach
0,2020-08-23 11:16:07,1457,0,0,NaN,0,{}
1,2020-03-27 22:01:35,1456,4,0,NaN,0,{}
2,2019-06-29 14:00:29,1455,1,0,NaN,1,{}
3,2019-02-27 17:14:36,1452,1,0,NaN,1,"{""photo"": {""id"": 456239362, ""owner_id"": 477700}}"
4,2019-02-16 15:40:07,1451,4,0,NaN,1,"{""photo"": {""id"": 456239316, ""owner_id"": 106017}}"

In [215]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 355 entries, 0 to 354
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          355 non-null    datetime64[ns]
 1   id            355 non-null    int64
 2   likes         355 non-null    int64
 3   req_count     355 non-null    int64
 4   attach_count  0 non-null      float64
 5   com_count     355 non-null    int64
 6   attach        355 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(4), object(1)
memory usage: 19.5+ KB

Then we split column date for grouping values.

In [216]:
df["year"]=df['date'].apply(lambda x: x.year)
df["month"]=df['date'].apply(lambda x: x.month)
df["day"]=df['date'].apply(lambda x: x.day)
df["week_day"]=df['date'].apply(lambda x: x.weekday())
df["hour"]=df['date'].apply(lambda x: x.hour)

In [217]:
df.head()

,date,id,likes,req_count,attach_count,com_count,attach,year,month,day,week_day,hour
0,2020-08-23 11:16:07,1457,0,0,NaN,0,{},2020,8,23,6,11
1,2020-03-27 22:01:35,1456,4,0,NaN,0,{},2020,3,27,4,22
2,2019-06-29 14:00:29,1455,1,0,NaN,1,{},2019,6,29,5,14
3,2019-02-27 17:14:36,1452,1,0,NaN,1,"{""photo"": {""id"": 456239362, ""owner_id"": 477700}}",2019,2,27,2,17
4,2019-02-16 15:40:07,1451,4,0,NaN,1,"{""photo"": {""id"": 456239316, ""owner_id"": 106017}}",2019,2,16,5,15

**Now you can create Pivot tables like**: (year/month/week day etc.)-mean(number of likes/comments/reposts etc.)-count of items

In [218]:
pd.pivot_table(df, index=["year"], values=["likes"], aggfunc=np.mean)

         likes
year
2012  1.333333
2013  0.941176
2014  1.814815
2015  2.790323
2016  2.160714
2017  2.051282
2018  4.166667
2019  2.500000
2020  2.000000

In [219]:
pd.pivot_table(df, index=["month"], values=["likes"])

          likes
month
1      1.185185
2      2.093750
3      1.884615
4      2.166667
5      2.052632
6      2.902439
7      1.781250
8      2.380952
9      4.068966
10     1.309524
11     1.615385
12     1.114286

In [220]:
pd.pivot_table(df, index=["week_day"], values=["likes"], aggfunc=[np.mean, len])

              mean   len
             likes likes
week_day
0         1.461538    52
1         1.509804    51
2         1.656716    67
3         2.375000    48
4         3.073171    41
5         2.488372    43
6         1.943396    53